read_verilog /scratch1/skoranne/OPENLANE/GCD/designs/CPU/FIFO2.v
read_verilog /scratch1/skoranne/OPENLANE/GCD/designs/CPU/RegFile.v
read_verilog mkALU.v
read_verilog mkCPU.v
check
hierarchy -top mkCPU
flatten
proc
check
opt
stat

